controllers/BackupController.php

SELECT * FROM `merchant_user` WHERE `phone`='15659675727'
UPDATE `merchant_user` SET `password`='147159', `grade`=0 WHERE `phone`='15659675727'
---
    public function  actionResetthird()
    {
        $session = \Yii::$app->session;
        $session->open();
        $model = new MerchantUser(['scenario'=>'resetThird']);
        if($model->load(\Yii::$app->request->post()) && $model->validate() && $session->has('resetPassword'))
        {
            $phone = $session['resetPassword']['phone'];
            $data = \Yii::$app->request->post();
            $database = $model::findOne($phone);
            $database->password =$data['MerchantUser']['password'];
            $database->save();