models/MerchantUser.php

    public function validateSms($attribute)
    {
        if(!$this->hasErrors())
        {
            $session = \Yii::$app->session;
            $session->open();
            if($session->has('phone') && $session['phone']['validTime']>time())
            {
                $phone = static::findByPhone($this->phone);
---
SELECT * FROM `merchant_user` WHERE `phone`='15659675727'

    public function validatePassword($attribute)
    {
        if (!$this->hasErrors()) {
            $phone = static::findByPhone($this->phone);
---
SELECT * FROM `merchant_user` WHERE `phone`='15659675727'