models/MerchantUser.php

SELECT * FROM `merchant_user` WHERE `phone`='15659675727'
---
    public function login(){
        if($this->validate())
        {
            return Yii::$app->user->login(static::findByPhone($this->phone),$this->rememberMe ? 3600*24*30 : 0);

SELECT * FROM `merchant_user` WHERE `phone`=1
---
    public static function findIdentity($phone)
    {
        return static ::findOne($phone);